
HELP_TEXT = """
Для запуска бота введите команду /start.
Для получения подсказки по работе с ботом введите команду /help.
Для поиска директории на сервере введите часть имени директории.
\t например: names
после отправки данного сообщения боту, будут найдены и предложены для выбора все директории, в названити которых будет найдено слово names.
Далее выберите нужную директорию из списка, затем вам отобразится список файлов находящихся в данной директории и в ее поддиректориях.
Выберите нужный файл для скачивания или скачайте все файлы."""

WARNING_PRIVATE_MODE = f'Данный бот может использоваться только в личном чате.'
WARNING_NO_ARG = "Пожалуйста, укажи название каталога!"

ANSWER_FOLDER_IS_FOUND = 'Директории найденые по запросу "{}".'
ANSWER_OPEN_FOLDER = 'Содержание директории {}, выберите файл для скачивания или скачайте все фалый.'
SHUTDOWN_INLINE = 'Вы выбрали {}'
CANCEL_MSG = 'Отмена поиска. Чтобы найти нужную папку введите часть имени директории и отправте сообщение.'
ANSWER_NOT_FOUND_FILE = 'Директория пуста.'
ANSWER_NOT_FOUND_FOLDER = 'Директории с таким названием не существует.'



